import { 
  AUDIO_PLAY_TEXT,
  AUDIO_PLAY_IMG,
  AUDIO_PAUSE_TEXT,
  AUDIO_PAUSE_IMG
} from '../../../utils/constants.js'
import api from '../../../api/api.js'
import util from '../../../utils/util.js'

Page({
  data: {
    essay: {},
    audioBtn: {
      text: AUDIO_PLAY_TEXT,
      imgPath: AUDIO_PLAY_IMG
    }
  },
  onLoad: function (options) {
    api.getEssayById({
      query: {
        id: options.id
      },
      success: (res) => {
        res = {data:{
  "res": 0,
  "data": {
    "content_id": "1737",
    "hp_title": "时间流逝之殇",
    "sub_title": "",
    "hp_author": "刘文",
    "auth_it": "审计师，青年写作者。@刘文tracy",
    "hp_author_introduce": "（责任编辑：向可 xiangke@wufazhuce.com）",
    "hp_content": "“我很怕老去。”<br>\r\n“你觉得多少岁是老？”<br>\r\n“二十五岁，我害怕失去少年的心境。”<br>\r\n“那我马上就老了。”<br>\r\n“没关系，我会娶你。让你在我身边变老。”<br>\r\n“你有戒指吗？”<br>\r\n“你要的话，我就有。”<br>\r\n <br>\r\n二十五岁的生日到来的那天我正和男朋友C冷战，闺蜜们陪我在兰桂坊喝了很多酒，驻场的钢琴手弹了好多我喜欢的曲子送给我，我又哭又笑，穿着高跟鞋走下那个长长的斜坡的时候好几次差点摔跤。彼时的我觉得长大是一件很恐怖的事情，需要满足更多人，更宏大的期待。<br>\r\n<br>\r\n好在二十五岁来了又过了，连带着之后二十六岁，二十七岁，曾经朝夕相处的人慢慢就到了一年也不会说一句话的地步，我当年上完瑜伽课手拉手去吃芒果刨冰的闺蜜相亲成功，很快就结了婚有了孩子，因为讨厌香港的梅雨季节天天下雨，我搬去了一个半年才下一场雨的地方。虽然我当年下定决心要留在原地和同一个人一辈子携手到老，也不可避免地被卷入了时间流逝的洪荒之中。<br>\r\n <br>\r\n在我二十八岁生日的前一天我收到了C发来的邮件。<br>\r\n <br>\r\n电脑提示有新邮件的时候我正在电话里和艾伦吵架，我刚卖出去一个短片的剧本，艾伦要我分他一半，因为我写剧本是因为和他相处才有了灵感。<br>\r\n艾伦说，不给钱你就走着瞧吧，我愤恨地把桌上的花瓶砸到沙发上，因为怕碎。<br>\r\n <br>\r\nC说来美国出差，顺便休几天年假，问有没有空吃个饭。<br>\r\n我迫不及待想要在他面前表现得寡淡冷漠，所以克制了很久，才允许自己颤抖着手回复了他一个字：“好”。<br>\r\n“我10号到15号都有空，时间和地点你挑。”他立刻就回复了我。<br>\r\n <br>\r\n我最后还是决定到机场去接他。他说是顺路来看我，其实他开会的地方在芝加哥，离洛杉矶差了十万八千里。他周六晚上开完会，连夜坐飞机过来，到的时候正好是清晨。<br>\r\n等他的时候我百无聊赖地刷着微信，顺便在网上搜和前男友见面的十大攻略。然后我听到那个熟悉的声音在我耳边说“Hi”。<br>\r\n就那么一个字，振聋发聩，我腿都软了。<br>\r\n <br>\r\n我和C认识是他在香港出差的时候，我们刚刚坠入爱河，他就要回到悉尼去，他原本是周日晚上走，结果临时改了早上的飞机，起床后我蓬头垢面跳上一辆出租车就往机场赶，一边赶一边看着头顶上空划过赤腊角海湾，然后在大屿山上方拉起来的飞机，生怕等我到的时候他已经走了。<br>\r\n我还记得那回到了机场之后，遍地找不到他的人，手机也打不通，却一抬头看到他在冲我招手说“Hi”,他穿着浅灰色的上衣和裤子，坐在玻璃幕墙边上抽烟，整个人都隐匿到后面宏大的背景中去。<br>\r\n <br>\r\n如今依然是机场，他依然连帽衫和运动裤，依然站在我面前，背着大包小包地冲我笑着。就像时光从未在我俩身上留下任何痕迹。<br>\r\n <br>\r\n我带着C去洛杉矶华人区的海鲜酒店吃粤式早茶。<br>\r\n我记得和他的无数次争吵，中间还夹杂了他的欺骗，我的隐瞒，其他的男男女女，但是如今回想起和他在一起的时光，能想起来的都是些平实的细节，比如我和他去吃避风塘炒蟹，他会把蟹钳拆开了，把最大的那块肉塞在我嘴里；比如好多人一起去吃火锅，他能精准地夹起芝士包心丸放在我碗里；比如过马路的时候我鞋带松了，他会很自然地蹲下来帮我系好。<br>\r\n <br>\r\n“到底还是香港的更正宗些。”在人声鼎沸的茶楼里，我要凑得很近才能听到他说话，于是又不可避免地看到他长长的金色睫毛，和像大海一样蔚蓝的眼睛。<br>\r\n这个是八十年代移居来美国的香港人开的酒楼，门口的牌匾和角落里供奉的菩萨都和香港的一模一样，但是海鲜吃起来却少了很多细腻。<br>\r\n“是啊，我现在每天都想念香港的吃的。”我回答。<br>\r\n“你家楼下那家酸辣猪扒米线真是最好的宵夜，我之后再也没有吃到过那么好吃的汤头。”C啧啧嘴。<br>\r\n“我已经两年没回香港了，你后来去过香港没有？”我问C，我和他还在一起的时候，他几乎每两个月都要来一次香港，有的时候是出差，有的时候是看我，他发誓他会在三年内搬来香港，然后就娶我。<br>\r\n“我不是一直想调来香港分公司吗，可是每次都申请不到，谁知道我们分手之后两个月，申请突然就批下来了。”他苦笑一下。<br>\r\n“那你调去香港了吗？”我问他。<br>\r\n“没有。你还记得那时候我打电话给你吗？打了快有十次你才接起来，你声音很冷淡地告诉我你要去美国了。你不在了，我过去又有什么意义？”他转开脸，假装对墙上的一幅字画产生了兴趣。<br>\r\n“对不起。”我轻声说，也放下了筷子。<br>\r\n“没关系，我没去香港，后来我的上司离职，他们让我做了悉尼办公室的经理，工资翻了一倍，最近刚买了房。”他飞快地瞥了我一眼，脸上的表情在阴影里看不真切，“有了房子之后，我又养了只猫，英短，你一定会喜欢的。”<br>\r\n这顿饭我吃得很少，而C也很少动筷。<br>\r\n <br>\r\n“你这几天准备做什么？”我问他，“我特意向实习的老板请了几天假。”<br>\r\n“真的吗？”他露出喜出望外的神色，“我想开车去大峡谷看看。你去过那里吗？”<br>\r\n“八年前和家人来旅游的时候跟着旅行团去的，只记得行程很赶，除了拍下了几张照，别的什么都不记得。”<br>\r\n“我准备租车开过去，停在公园入口，然后再登山到南缘的顶峰。”<br>\r\n“听起来不错。”<br>\r\n<br>\r\n“如果现在出发的话，正好能赶上看日出。”<br>\r\n <br>\r\n我陪C去Enterprise租了一辆奔驰SUV，他眼也不眨地就刷了卡。<br>\r\n“现在你可是有钱人了。”我调侃他。<br>\r\n“和你在一起的时候常常要你贴钱请我吃饭，这回就都让我来付吧。”<br>\r\n <br>\r\n他中途停在我家楼下，陪我上去收拾行李。正好我的室友李艾和她的小男朋友在客厅做饭。<br>\r\n整个房间都弥漫着油烟和洋葱的味道，李艾正懒洋洋地搅拌着锅里面的东西，她看到C，又看了看我，然后眨了眨眼。<br>\r\n <br>\r\nC局促地站在李艾面前，不知道怎么介绍自己，我让C到我房间里面来。<br>\r\n我让他随便坐，一扭头才发现他直勾勾地望着我的洗漱台。<br>\r\n那里有我和艾伦在一起的时候，艾伦留在我家的洗面奶和须后水。<br>\r\n <br>\r\n我和艾伦在一起一年多，最初找他是因为他长相和声音都和C很像，我和艾伦在一起的时候，好多次差点把他叫成C。<br>\r\n艾伦说好不好，说不好也没什么不好，我早就知道他并不喜欢我，我对他也没有什么深厚的感情，只是觉得在异国他乡，有一个人能够说说话聊聊天，冬天的时候一起偎依在床上，总比孑然一身要好。<br>\r\n艾伦很尽责地能够在最恰当的时候给出最恰当的反应，他的情话说得很动听，眼神中的爱意几可乱真，但是他从来都不会记得我喜欢吃什么，也不会兑现他的任何承诺。我和艾伦从不吵架，但是并不代表我们之间很满意对方，所以当艾伦一忙起来之后，他就立刻把我甩了，投身于更重要的事业中去。<br>\r\n“已经分了，我现在是单身，所以你想对我做什么都可以。”我对他说，把洗漱台上的爽肤水粉底液睫毛膏一股脑儿收到化妆包里，想了一会儿，又把艾伦留下来的东西扔到了垃圾箱里。<br>\r\n“你不用为了我……”C做了个手势，指了指垃圾箱。<br>\r\n“早就该扔了，”我耸耸肩，“我和他早就没了往来，除了在学校里有时候会见到，他倒是时不时地问我能不能来我家过夜。”<br>\r\n“妈的，不如等下开车经过他家让我去揍他一顿。”C恨恨地说。<br>\r\n“放心，我的几个好朋友已经整过他了。”我摸了摸C的肩膀以示安慰，他气得脸都红了。<br>\r\n <br>\r\n我收拾好东西出去的时候，李艾正趴在桌上玩手机，她看到我出门，冲我比了个大拇指。<br>\r\n“怎么了？”C狐疑地问。<br>\r\n“她以为我有了新男朋友，正替我高兴呢。”<br>\r\n“那你高兴吗？”C问。<br>\r\n“起码比一般的日子更高兴吧。”<br>\r\n我和C沿着10号公路向东开去。<br>\r\n <br>\r\n我能感受到微妙的尴尬，C说，你随便放点音乐吧，有点声音就可以。他专注地看着前方，因为习惯了澳洲的靠左行驶，有几次他差点和隔壁道的车相撞。<br>\r\n“对不起。”他用盖过音乐的声音吼道，“像你说的一样，我什么都做不好。”<br>\r\n“我说过那句话吗？”我狐疑地问。<br>\r\n“说过，就在我们分手前一个星期。”<br>\r\n“对不起。我自己都不记得我说过。”“没关系。”他扭头冲我笑了一下，夜色里的他的笑容那么年轻，就像五年前我们第一次见面时一样。他左边脸颊的酒窝也是一模一样。<br>\r\n <br>\r\n我不自觉地把手放在他的膝盖上，他伸出一只手来握住我，但很快又缩回去，握着方向盘。<br>\r\n“我真是开不惯靠右行驶的路。”<br>\r\n“要我来开吗？”我问。<br>\r\n“不用了，我还记得我教你开车的时候，你差点把我们两条命都搭进去。”他撇撇嘴，那时候我把他新买的车的后视镜都给撞掉了。<br>\r\n“我现在开得还可以。”<br>\r\n“是吗？我想我已经不够了解你了。”他说，我们四目相对，然后又一起看向窗外。<br>\r\n“其实也没有变很多。”我轻轻地说。<br>\r\n <br>\r\n出城之前，我们在加油站加油，顺便买饮料和零食。他还记得我喜欢的薯片口味。<br>\r\n加油站有位老人央求我们载他到几十公里外他女儿经营的一家小旅馆去，老人叫乔治，背着一个旧书包，手里还拿着一罐啤酒。<br>\r\nC一口就答应了。<br>\r\n“好小伙，你可帮了我的大忙，我给你去买瓶啤酒。”<br>\r\n“谢谢，不用了，她从来不允许我开车喝酒。”C指了指我。<br>\r\n“你知道，喝杯啤酒不会违法交通规则的。”老人挥挥手，看了我一眼，“不过要是我有这么漂亮的女朋友，我也舍得不冒险。”<br>\r\n <br>\r\n老人乔治是位退伍军人。参加过朝鲜战争，越战，海湾战争，在冲绳驻扎过很多年，他拉开外套领子让我看他肩膀上的一个伤疤，那里曾经被子弹擦过，血肉愈合之后，留下了蜈蚣般曲折的回路。<br>\r\n“你们去哪儿？”他礼貌地问。<br>\r\n“我们去大峡谷。”<br>\r\n“那里有什么意思，除了山就是沙漠。”<br>\r\n“只是想去看看。”C出声回答。<br>\r\n“可能是我老了的缘故吧，只想呆在城市里，有酒有人才热闹。我有一间挺大的公寓，每周末我的女朋友就会来过夜。”说到女朋友，他满是褶皱的脸上露出了笑容。<br>\r\n“那你这么晚还出城做什么？”我问他。<br>\r\n“我女儿在棕榈泉那里经营一家旅店，我答应今晚去给她帮忙，谁能想到刚才加油的时候车子的引擎坏了。”<br>\r\n“听起来很有意思。”<br>\r\n“有什么意思？我有五个孩子，分别和三个老婆生的，现在他们都散落在美国的各个角落，有个女儿还嫁去了加拿大。我之前可是飙车出海攀岩样样都在行，但是现在老了，什么都做不了。”<br>\r\n“总是有可以做的事情嘛。”我安慰他。<br>\r\n“那倒是，我的女朋友比我小三十岁，常常粘着我，我虽然老了，但你别说，还能把她伺候得舒舒服服。”他冲我眨眨眼，喝光了手中的啤酒，“你们两个这么年轻，一定要想做什么就做什么，等你们老了，总会对这个世界心生厌烦。”<br>\r\n乔治讲着讲着就在车后座上睡着了，他孤独地缩成一团，靠在右边的玻璃窗上，此起彼伏地打着呼。<br>\r\n“他还以为我们是情侣。”C说这句话的时候依然笔直地看着前方。<br>\r\n“李艾也以为我们是情侣。”我说，“对啦，有一阵你突然神经兮兮发邮件过来说你有了未婚妻，那到底是怎么回事。要是你订婚了我肯定不和你一起去大峡谷！”<br>\r\n“难为你还记得这件事。我当时白天黑夜等着收你充满嫉妒的回信，你倒好，半个字都不回复我。”<br>\r\n“我当然嫉妒了，嫉妒得发狂，把你之前发给我的那些说永远都会爱我的邮件拿出来看，一边看一边痛苦。李艾差点把我拖去看心理医生。”<br>\r\n“那你也没回复我？”<br>\r\n“写了又删删了又写，不知道说什么，而且也不想打扰你的幸福。”<br>\r\n <br>\r\n车子穿过一个隧道，说话都有隆隆的回音。<br>\r\n“分手了。”C淡淡地说。<br>\r\n突然响起了乔治的打呼声。<br>\r\n我们在下一个路口把乔治唤醒，他在他女儿的旅馆门口下了车，临走前不忘嘱咐我和C要好好“享受人生”。<br>\r\n <br>\r\n高速公路在黑黢黢的崇山峻岭间延展，路上几乎一辆来车都见不到，只能看到马路上荧光色的小点指向远方。<br>\r\n“他的一生也挺酷的，”C说，“如果我们不用在乎金钱，绿卡，买房，工作，会不会好很多。”<br>\r\n“谁说他的一生中就没有难处了呢？”我反问。<br>\r\nC在难熬的寂静中又拧开了车载电台。<br>\r\n凌晨一点三十七分，电台里在播的是情感节目，有一位妇女在问如何对她结婚多年的丈夫重新产生激情。<br>\r\n“你知道，我早晨醒来，望着他胡子拉碴的睡颜，闻着他的口气，突然觉得很恐惧。<br>\r\n”电台里面的女声这样说道。<br>\r\n“性生活也非常无趣。”那个女声又补充道。<br>\r\nC伸手去关了电台。<br>\r\n <br>\r\n“你知道吗，我和未婚妻玛丽分手，也是这个原因。”C突然开口说。<br>\r\n“还记得我们约会了三个月，然后第一次上床的情景吗？”他问我。<br>\r\n我点点头，我又怎么会忘记，和他暧昧并彼此试探过三个月后，彼此忍不住挑明心迹，他终于将我搂在怀中的时候，一阵陌生又熟悉的感觉席卷了我，像静电一样在我体内流窜。我还记得那时候是冬天，但颤抖着探索彼此的身体让我浑身发烫。他的体温也高得吓人，指尖微微颤抖，除了他的鼻尖还带着窗外沾满露水的冷风。<br>\r\n和他的相遇从一开始就像是久别重逢，所以即使知道异国恋并不容易，我们还是义无反顾地陷入其中。<br>\r\n“玛丽对我很好，她比你温柔，比你有安全感，我喝酒晚归也不打我电话，而且那段时间我确实很寂寞，你总是不接电话，甚至连Facebook都把我屏蔽掉了。”C说，“但是我和玛丽无论如何都没办法有那种汹涌澎湃的感情，我最终还是不甘心就那么平淡下去，所以和她分了手。我真的是狠狠伤了她的心，在伤了你的心之后。”<br>\r\n“生活本来就应该是平淡的，像我们这么戏剧化才不正常。”我说，和C分手之后虽然难过，但过上按部就班的生活确实让我长舒了一口气。<br>\r\n“可能因为体会过爱的浓烈吧，所以很怕被卡在无聊的日常生活的齿轮上。”C下结论般地说。<br>\r\n“你可真是渣男啊。”<br>\r\n“是啊，但愿我不会伤害下一个爱我的人。”C和我分手前几个月查出来有躁郁症。这也解释了为什么他常常会控制不住自己的情绪，歇斯底里地发起怒来，或者令人疑惑地痛哭不已。<br>\r\n我从未质疑过他很爱我，但是也常常担心着他无法捉摸的发作。有几次他在家里发怒，摔碎了公寓里几乎所有可以摔碎的东西，而且抓着我的领子，死死把我定在墙角，捏得我的手腕咯咯作响。有几次他在外面发作，都是因为很小的事情，比如没有赶上公交车，或者错过了餐厅预订的用餐时间，他坐在地上嚎啕大哭，而且拼命推搡着要把我赶走，有一次我们差点被过路的车撞了，交警几乎要强制押他去医院。我害怕他失去理智的样子，怕到我每次和他见面都提心吊胆，最甜蜜的时候也胆战心惊。他常常说他心里面有个魔鬼，时不时就掌控他的脑子，让他做出些极端的举动来。<br>\r\nC的确诊让我更加沮丧，我原本以为爱能改变一切，但说真的，我又怎么能改变他自基因里带来的精神失调？<br>\r\n“我最近都有在吃药，我已经十七个月没发作了，所以你不用担心我会做出什么来。”C看到我沉默，有点儿担心地来拉我的手。<br>\r\n突如其来的肌肤接触让我在座位上惊跳了一下，我看到他受伤的眼神，主动伸手去拉住他的。<br>\r\n“要是你早点儿诊断出来，早点儿吃药，我们或许不会到这样的地步。”我说。<br>\r\n“如果我早点儿知道那是我们的最后一次见面，我一定会郑重地道个别。”C说。<br>\r\n <br>\r\n那个时候他来香港看我，每天早晨做饭给我吃。最后那天他给我做了煎蛋，煎了培根，用三花淡奶冲了冻奶茶。然后他送我到地铁站，在地铁入闸口把我的包和文件夹都递给我，亲了亲我的嘴唇。<br>\r\n“下回就轮到你来悉尼看我了。”他很潇洒地拍了拍我的肩膀，然后有点外八字地大步走开了，他在人群中的背影那么明显，我直到地铁来了还在伸着脖子远眺。<br>\r\n他飞回悉尼不久，我们再一次因为微不足道的事情吵了架，彼此撂了很多狠话，他情绪突然崩溃，我们在电话里大吼大叫和哭泣过，然后就是那么一个瞬间，我们突然意识到再也无法相处下去了，于是就立刻很平静地分手，没有第三者也没有钱财瓜葛，他把我公寓的钥匙寄还给我，我把他送我的戒指退还给他，彼此以迅雷不及掩耳的程度退出了对方的生活。<br>\r\n“也不是最后一次见面啊，我们现在不正面对面呢嘛。”我笑着说。<br>\r\n“也是。”他回答，之后就是长久的尴尬。<br>\r\n我们经过下一个加油站的时候，有对男女在路灯下吵架。女人哭得歇斯底里，男人走出去很远又回来，把外套披在女人肩上。<br>\r\n <br>\r\n因为送乔治去棕榈泉，我们额外绕了很多路，凌晨三四点的时候，C已经很累了。<br>\r\n“我们好像没办法在日出前赶到了。”他有点沮丧地说。<br>\r\n“谁在乎日出什么的呀。”我说。<br>\r\n <br>\r\n我们很有默契地下了高速，开始找东西吃。<br>\r\n高速路边的麦当劳已经开始卖早餐。<br>\r\nC给我买了早餐全餐，炒蛋，汉堡扒，炸薯饼，热香饼和糖浆一字排开。他冲我笑起来，经过短短一夜，他的下巴上已经长出了青色的胡茬。<br>\r\n他不发脾气的时候，简直是天底下最讨人喜欢的人，他幽默又健谈，见识很广，头脑转得很快，我的朋友们都喜欢听他讲在世界各地旅行遇到的趣事。那个时候我在写小说集，夜晚常常失眠，他和我用skype聊着天，他一边趴在床上困得不行，一边信口开河地给我讲故事。<br>\r\n我现在看着他给我张罗早餐，把一杯热乎乎的可可塞到我冻僵的手里，觉得恍如隔世。<br>\r\n <br>\r\n我也不知道为什么就哭起来，身体在暖气下面化成了一摊水。<br>\r\n“没关系的，我在的，会好起来的。”C搂着我的肩膀安慰我，他递给我餐巾纸，让我大声地擤鼻涕，不停地拍我的背。<br>\r\n小的时候母亲对我很严厉，我每次哭泣她都会叫我不要哭，所以我每次哭都是无声无息地在流眼泪，C则在一边说，你要难过你就哭出来啊，哭出来会好很多。但我终究还是止住了眼泪，哭泣之后我才觉得饥饿，一个人吃光了整份套餐，C又去买了一份。C吃完之后，我们很默契地朝不远处一家汽车旅馆开去。<br>\r\n <br>\r\nC洗澡后喷了古龙水，他的亲吻闻起来很熟悉。他用的古龙水依旧是我们第三次约会的时候我送给他的那款。<br>\r\n我们开始熟悉又陌生地抚摸对方的皮肤，他右肩膀上的纹身是他曾效力的一家橄榄球队，是当地一个很小的几乎没人知道的俱乐部，我每次去看他，都会在年久失修的体育馆里喝着劣质啤酒为他加油，自从和他分手之后，我一场橄榄球赛都没有看过。两年没见，他发福了很多，肩膀和胸前的肌肉隐藏在一层软软的脂肪下面，我试着枕在他的胸口，那是以前我们同床共眠时的姿势，他总会强势地用一只手把我箍在他的胸前，有时候我去上厕所，他会特别惊惶地醒来，在黑夜里紧张地唤我的名字。<br>\r\n“和你分手之后，我做任何事情都提不起精神，也退出了球队。”他有些自嘲地拍了拍他挺起的啤酒肚，“这么多罐啤酒里，有一大半都是为了想忘记你才喝的。”<br>\r\n“需要我道歉吗?”我问。<br>\r\nC咯咯地开始笑，他说，不公平，为什么你分手之后反而瘦了，还有了肌肉。<br>\r\n“要变美才能找到下家啊。”我开玩笑。<br>\r\n“我不希望你的下家是因为你美就跟你在一起。”C正色说。他一直很介意这一点，所以我们才约会了三个月都没有上床，他一直说，我希望你知道，你即使不用付出身体也能得到我的爱。<br>\r\n <br>\r\n我们开始缓慢地亲吻对方。他从我的脖子一路亲到我的锁骨，他依然记得我每一个敏感的地带，但是记忆中那种浑身像通了电流一样酥麻的感觉并没有如期而至。我转头去看C，他看起来也很困惑。<br>\r\n我们又试了试，还是没感觉。<br>\r\nC站起身来，穿好了他的四角内裤。我去洗手间换上了睡衣。<br>\r\n“我能不能抽根烟？”C问，他很喜欢抽烟，但因为我有哮喘，所以特意为我戒了。<br>\r\n“请便。”我指了指窗口。<br>\r\n他走过去把窗打开，把烟圈吐到晨光里面去。天已经全亮了。<br>\r\n“我以为我们两个都还没有变。”他沙哑着说，他的眼睛里布满红血丝。<br>\r\n“就是因为我们两个都没有变，所以你没有办法假装我们之间的那些矛盾都不存在。”<br>\r\nC坐下来，头颓然地垂在双手间。<br>\r\n“刚才在加油站，乔治偷偷告诉我，说看得出来我们吵架了，让我好好哄你。我要怎么才能哄好你呢？”<br>\r\n“我以为你分手之后会和简在一起，我们当年约会的时候，她就常常想来插一脚。”我岔开话题。<br>\r\n“你不说我都忘记她了。没有简，也没有其他人，你知道我们并不是因为感情破裂才分开的。”<br>\r\n“我知道。我天生敏感没有安全感，你又有躁郁症。我们是真的不适合在一起。”我说。<br>\r\n“我想是的。”过了半晌他才终于回答道。<br>\r\n <br>\r\n我们和衣躺在汽车旅馆散发着霉味的床上，我还枕在他的胸口，他还用一只手充满占有欲地把我圈起来，所有的动作都毫无情欲。<br>\r\n我被短信吵醒，是李艾发来的，她说，你昨晚没回家，一定很爽，顺便配一个做鬼脸的表情。<br>\r\n我回复的时候，C也醒了，他开始把衣服和沐浴露都放到行李箱里面去。<br>\r\n“你很想去大峡谷吗？”他问。<br>\r\n“其实一般，你知道我很讨厌登山，慢跑这类长时间重复的运动。”<br>\r\n“要不我们回洛杉矶吧，我想去圣塔莫尼卡海边喝杯酒。”C说。<br>\r\n我说好。<br>\r\n <br>\r\n在我们准备去退房的时候，C长叹了一口气，他从裤袋里拿出一个红色的天鹅绒小盒子，打开给我看。<br>\r\n里面躺着我退还给他的那枚戒指，但是戒指上镶了一颗小小的钻石，那么美，那么闪耀。<br>\r\n“我准备登上大峡谷顶峰看日出的时候向你求婚来着。”他有点不好意思地说。<br>\r\n“你那年在马来西亚的时候就求过，在热带雨林登山的时候，”我打趣，“还是一样的套路。”<br>\r\n那年他的奶奶去世，把家族祖传的戒指留给了他，他买通了导游，偷偷摸摸策划了一场求婚。有一阵子我们总是去看婚纱展，他拉着我让我试各种各样的婚纱，我喜欢短款的，他非要我穿长款的鱼尾裙。<br>\r\n“那时候买不起钻石给你，现在终于买得起了。”他说。<br>\r\n“你说我你会永远爱着我，原来你是当真的。”我望着他的眼睛，他的红血丝，他脸上的雀斑，他鼻尖的绒毛，他下巴上的胡茬。我多么想欺骗自己我们能够回到过去，假装一切都没发生过。<br>\r\n“我说过的每一句话我都记得。”他的眼神里充满忧伤。<br>\r\n“把你的钻石留着吧，总会有好姑娘配得上的。”我哽咽着推开了他的手。<br>\r\n <br>\r\n开回去的路顺畅了很多，电台里面播着摇滚乐，C一边开车一边跟着节奏晃着脑袋。<br>\r\n沙漠里干巴巴的风从窗外吹来。我想起上一次坐在他的副驾驶上，我们正开在香港新界的盘山公路上，车里闷热得像个牢笼，空气湿漉漉的，衣服牢牢地粘在身上，我们正急着开去广州，C要在那里见我的父母。<br>\r\n <br>\r\n在时间的长河里，到底是什么都没变，还是什么都变了呢？",
    "hp_makettime": "2017-01-13 08:00:00",
    "hide_flag": "0",
    "wb_name": "",
    "wb_img_url": "",
    "last_update_date": "2017-01-13 10:48:43",
    "web_url": "http://m.wufazhuce.com/article/1737",
    "guide_word": "我觉得长大是一件很恐怖的事情，需要满足更多人，更宏大的期待。",
    "audio": "http://music.wufazhuce.com/lpg_uW1kGaTw3XzjOoq4h3--eojz",
    "anchor": "朗读者-马晓橙",
    "editor_email": "xiangke@wufazhuce.com",
    "top_media_type": "0",
    "top_media_file": "",
    "top_media_image": "",
    "start_video": "",
    "copyright": "",
    "author": [
      {
        "user_id": "4814676",
        "user_name": "刘文",
        "desc": "审计师，青年写作者。@刘文tracy",
        "wb_name": "",
        "is_settled": "0",
        "settled_type": "0",
        "summary": "审计师，青年写作者。@刘文tracy",
        "fans_total": "94",
        "web_url": "http://image.wufazhuce.com/Fgs5kZ36FmPNRo7BqSBisRvcSodM"
      }
    ],
    "maketime": "2017-01-13 08:00:00",
    "author_list": [
      {
        "user_id": "4814676",
        "user_name": "刘文",
        "desc": "审计师，青年写作者。@刘文tracy",
        "wb_name": "",
        "is_settled": "0",
        "settled_type": "0",
        "summary": "审计师，青年写作者。@刘文tracy",
        "fans_total": "94",
        "web_url": "http://image.wufazhuce.com/Fgs5kZ36FmPNRo7BqSBisRvcSodM"
      }
    ],
    "next_id": 0,
    "previous_id": "1731",
    "tag_list": [],
    "share_list": {
      "wx": {
        "title": "阅读 | 时间流逝之殇",
        "desc": "文/刘文 我觉得长大是一件很恐怖的事情，需要满足更多人，更宏大的期待。",
        "link": "http://m.wufazhuce.com/article/1737",
        "imgUrl": "http://image.wufazhuce.com/ONE_logo_120_square.png"
      },
      "weibo": {
        "title": "ONE·一个《阅读 | 时间流逝之殇》 文/刘文： 我觉得长大是一件很恐怖的事情，需要满足更多人，更宏大的期待。 阅读全文：http://m.wufazhuce.com/article/1737 下载ONE·一个APP:http://weibo.com/p/100404157874",
        "desc": "",
        "link": "",
        "imgUrl": ""
      },
      "qq": {
        "title": "时间流逝之殇",
        "desc": "我觉得长大是一件很恐怖的事情，需要满足更多人，更宏大的期待。",
        "link": "http://m.wufazhuce.com/article/1737",
        "imgUrl": "http://image.wufazhuce.com/ONE_logo_120_square.png"
      }
    },
    "praisenum": 596,
    "sharenum": 111,
    "commentnum": 123
  }
}}
        if (res.data.res === 0) {
          let essay = res.data.data
          essay.hp_content = util.filterContent(essay.hp_content)
          essay.hp_makettime = util.formatMakettime(essay.hp_makettime)
          this.setData({ essay })
        }
      }
    })
  },
  onReady: function () {
    wx.setNavigationBarTitle({
      title: '短篇'
    })
  },
  togglePlay: function (e) {
    var audio = this.data.essay.audio
    var audioBtn = this.data.audioBtn
    
    if (audioBtn.text === AUDIO_PLAY_TEXT) {
      audioBtn = {
        text: AUDIO_PAUSE_TEXT,
        imgPath: AUDIO_PAUSE_IMG
      }
      this.playAudio(audio)
    } else {
      audioBtn = {
        text: AUDIO_PLAY_TEXT,
        imgPath: AUDIO_PLAY_IMG
      }
      this.pauseAudio()
    }

    this.setData({ audioBtn })
  },
  playAudio: function (audio) {
    var title = this.data.essay.hp_title
    wx.playBackgroundAudio({
      dataUrl: audio,
      title: title
    })
  },
  pauseAudio: function () {
    wx.pauseBackgroundAudio()
  }
})